//Напишите программу, которая принимает на
//вход трёхзначное число и на выходе показывает вторую
//цифру этого числа.

int number = 456;
Console.WriteLine(number / 10 % 10);
