// Напишите программу, которая принимает на
//вход цифру, обозначающую день недели, и проверяет,
//является ли этот день выходным.

int number = 5;

if (number >= 1 && number <= 5)
Console.WriteLine("нет");
else 
Console.WriteLine("да");